/**********************************************************************
 * \file   GameManager.h
 * \brief  Objectクラスの宣言
 * \author かいちょー
 * \date   2020/6/24
 * \note   参考サイト⇒
 * \par    History
 *         2020/6/24
 *         ◆ファイルの作成
 *********************************************************************/

#include "GameManager.h"

 /**********************************************************************
  * \fn      GameManager()
  * \brief   ゲームマネージャーのコンストラクタ
  * \param   なし
  * \return  なし
  *********************************************************************/
GameManager::GameManager() {

}

/**********************************************************************
 * \fn      ~GameManager()
 * \brief   ゲームマネージャーのデストラクタ
 * \param   なし
 * \return  なし
 *********************************************************************/
GameManager::~GameManager() {

}

/**********************************************************************
 * \fn      Init()
 * \brief   ゲームマネージャーの初期化処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void GameManager::Init() {

}

/**********************************************************************
 * \fn      Final()
 * \brief   ゲームマネージャーの終了処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void GameManager::Final() {

}

/**********************************************************************
 * \fn      Update()
 * \brief   ゲームマネージャーの更新処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void GameManager::Update() {

}