/**********************************************************************
 * \file   Player.h
 * \brief  Playerクラスの宣言
 * \author かいちょー
 * \date   2020/6/25
 * \note   参考サイト⇒
 * \par    History
 *         2020/6/25
 *         ◆ファイルの作成
 *********************************************************************/

#include "Player.h"
#include "DxLib.h"

 /**********************************************************************
  * \fn      Player()
  * \brief   プレイヤーのコンストラクタ
  * \param   なし
  * \return  なし
  *********************************************************************/
Player::Player(float _x, float _y, float _width, float _height) {
	x = _x;
	y = _y;
	width = _width;
	height = _height;
}

/**********************************************************************
 * \fn      Init()
 * \brief   プレイヤーの初期化処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void Player::Init() {

}

/**********************************************************************
 * \fn      Final()
 * \brief   プレイヤーの終了処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void Player::Final() {

}

/**********************************************************************
 * \fn      Update()
 * \brief   プレイヤーの更新処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void Player::Update() {

}

/**********************************************************************
 * \fn      Draw()
 * \brief   プレイヤーの描画処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void Player::Draw() {
	DrawBoxAA(x, y, x + width, y + height, GetColor(255, 255, 255), TRUE);
}

/**********************************************************************
 * \fn      HitAction()
 * \brief   プレイヤーの当たった時の処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void Player::HitAction() {

}