/**********************************************************************
 * \file   Title.h
 * \brief  Titleクラスの宣言
 * \author かいちょー
 * \date   2020/6/20
 * \note   参考サイト⇒https://dixq.net/g/
 * \par    History
 *         2020/6/20
 *         ◆ファイルの作成
 *********************************************************************/

#include "Title.h"
#include "DxLib.h"

 /**********************************************************************
  * \fn      Title()
  * \brief   Titleのコンストラクタ
  * \param   SceneChanger *changer
  * \return  なし
  *********************************************************************/
Title::Title(SceneChanger* changer) :BaseScene(changer) {

}

/**********************************************************************
 * \fn      Init()
 * \brief   タイトルシーンの初期化処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void Title::Init() {

}

/**********************************************************************
 * \fn      Final()
 * \brief   タイトルシーンの終了処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void Title::Final() {

}

/**********************************************************************
 * \fn      Update()
 * \brief   タイトルシーンの更新処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void Title::Update() {
	if (CheckHitKey(KEY_INPUT_SPACE) != 0) {
		sceneChanger->ChangeScene(SceneState::Game);
	}
}

/**********************************************************************
 * \fn      Draw()
 * \brief   タイトルシーンの描画処理
 * \param   なし
 * \return  なし
 *********************************************************************/
void Title::Draw() {
	DrawString(0, 0, "タイトルシーン", GetColor(255, 255, 255));
}